Tekla Open API Reference for Tekla Structures 2025
RebarSplice Constructor (RebarGroup, RebarGroup)
 Initializes a new rebar splice instance with rebar groups to be joined.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSplice(
	RebarGroup InputRebar1,
	RebarGroup InputRebar2
)
Public Sub New (
	InputRebar1 As RebarGroup,
	InputRebar2 As RebarGroup
)
Parameters
InputRebar1
Type: Tekla.Structures.Model.RebarGroup
The first rebar group to be used.
InputRebar2
Type: Tekla.Structures.Model.RebarGroup
The second rebar group to be used.
See Also
Reference
RebarSplice Class
RebarSplice Overload
Tekla.Structures.Model Namespace